app/controllers/animals_controller.rb

  def create
    @animal = Animal.new(animal_params)
    @animal.user = current_user
    respond_to do |format|
      if @animal.save
        format.html { redirect_to @animal, notice: 'Animal was successfully created.' }
        format.json { render :show, status: :created, location: @animal }
      else
        @zonas = Zona.all
---
SELECT "zonas".* FROM "zonas"