app/controllers/animals_controller.rb

SELECT "animals".* FROM "animals" WHERE (nom LIKE '%mono%')
---
  def index
    @buscar = params[:buscar]
    if @buscar==""
      @animals = Animal.all

SELECT  "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
 def show
   @animal = Animal.find(params[:id])

SELECT "zonas".* FROM "zonas"
SELECT "users".* FROM "users"
---
 def new
   @zonas = Zona.all
   @users = User.all

SELECT "animals".* FROM "animals"
INSERT INTO "animals" ("nom", "raza", "zona_id", "any_naixement", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["nom", "qweqew"], ["raza", "wdad"], ["zona_id", 1], ["any_naixement", "2019-03-06"], ["user_id", 1], ["created_at", "2019-03-06 18:44:19.063470"], ["updated_at", "2019-03-06 18:44:19.063470"]]
---
 def create
   @animals = Animal.all
   @animal = Animal.create(animal_params)

SELECT "zonas".* FROM "zonas"
SELECT "users".* FROM "users"
SELECT  "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
 def edit
   @zonas = Zona.all
   @users = User.all
   @animal = Animal.find(params[:id])

SELECT  "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
---
 def delete
   @animal = Animal.find(params[:animal_id])

SELECT "animals".* FROM "animals"
SELECT  "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
DELETE FROM "animals" WHERE "animals"."id" = ?  [["id", 17]]
---
 def destroy
   @animals = Animal.all
   @animal = Animal.find(params[:id])
   @animal.destroy