app/controllers/api_controller.rb

  def zonas
    @zonas = Zona.all
---
SELECT "zonas".* FROM "zonas"

  def animals
    @animals = Animal.all
---
SELECT "animals".* FROM "animals"