app/controllers/zonas_controller.rb

  def index
      @zonas = Zona.all
---
SELECT "zonas".* FROM "zonas"

    def show
      @zona = Zona.find(params[:id])
---
SELECT  "zonas".* FROM "zonas" WHERE "zonas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
      @zonas = Zona.all
      @zona = Zona.create(zona_params)
---
SELECT "zonas".* FROM "zonas"
INSERT INTO "zonas" ("nom", "clima", "temperatura", "humitat", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nom", "qweqewqw"], ["clima", "qweqew"], ["temperatura", 12], ["humitat", 12], ["created_at", "2019-03-06 17:31:22.913702"], ["updated_at", "2019-03-06 17:31:22.913702"]]

    def edit
      @zona = Zona.find(params[:id])
---
SELECT  "zonas".* FROM "zonas" WHERE "zonas"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

    def update
      @zonas = Zona.all
      @zona = Zona.find(params[:id])

      @zona.update_attributes(zona_params)
---
SELECT "zonas".* FROM "zonas"
SELECT  "zonas".* FROM "zonas" WHERE "zonas"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "zonas" SET "nom" = ?, "clima" = ?, "temperatura" = ?, "updated_at" = ? WHERE "zonas"."id" = ?  [["nom", "qwdeadwqwda"], ["clima", "adwadwwasdad"], ["temperatura", 18], ["updated_at", "2019-03-12 18:10:51.523104"], ["id", 7]]

    def delete
      @zona = Zona.find(params[:zona_id])
---
SELECT  "zonas".* FROM "zonas" WHERE "zonas"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

    def destroy
      @zonas = Zona.all
      @zona = Zona.find(params[:id])
      @zona.destroy
---
SELECT "zonas".* FROM "zonas"
SELECT  "zonas".* FROM "zonas" WHERE "zonas"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "zonas" WHERE "zonas"."id" = ?  [["id", 7]]